
# 444444444444
# Типы дынных:
# 1)атомарные
# числа;
# x = 9
# print(x)
# строки;


# 2)сылочные
# списки;
# numbers = [1,64,84]
# print(numbers[0])
# кортежи;
# словари;
# функции;
# классы;



# 3)основные типы данных
# числа;
# строки;
# логический тип данных;
# списки;
# кортежи;
# словари;
# None




# Неизменяемые
# числа
# строки
# логический тип данных
# кортежи

# Изменяемые
# словари;
# списки;
# множество








# Философия Питона:
# import this
# Красивое лучше, чем уродливое.
# Явное лучше, чем неявное.
# Простое лучше, чем сложное.
# Сложное лучше, чем запутанное.
# Плоское лучше, чем вложенное.
# Разреженное лучше, чем плотное.
# Читаемость имеет значение.
# Особые случаи не настолько особые, чтобы нарушать правила.
# При этом практичность важнее безупречности.
# Ошибки никогда не должны замалчиваться.
# Если они не замалчиваются явно.
# Встретив двусмысленность, отбрось искушение угадать.
# Должен существовать один и, желательно, только один очевидный способ сделать это.
# Хотя он поначалу может быть и не очевиден, если вы не голландец [^1].
# Сейчас лучше, чем никогда.
# Хотя никогда зачастую лучше, чем прямо сейчас.
# Если реализацию сложно объяснить — идея плоха.
# Если реализацию легко объяснить — идея, возможно, хороша.
# Пространства имён — отличная штука! Будем делать их больше!